In [5]:
# pip install cx_Oracle (oracle 11g까지)
# pip install oracledb (oracle 12부터 )
# pip install pymysql (MYSQL)
# pip install pandas

import cx_Oracle

# 방법1
# dsn = cx_Oracle.makedsn('210.121.189.12', 1521, 'xe')
# conn = cx_Oracle.connect(user='scott', password='tiger', dsn=dsn)

# 방법2
conn = cx_Oracle.connect('scott', 'tiger', '210.121.189.12:1521/xe')
cursor = conn.cursor()
sql = "SELECT * FROM EMP"
cursor.execute(sql)
emps = cursor.fetchall()
cursor.description
keys = [desc[0] for desc in cursor.description]
# emp_list = []
# for emp in emps:
#     emp_list.append(dict(zip(keys, emp)))
emp_list = [dict(zip(keys, emp)) for emp in emps]
print(emp_list)
cursor.close()
conn.close()

[{'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': datetime.datetime(1980, 12, 17, 0, 0), 'SAL': 800.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 2, 20, 0, 0), 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': 30}, {'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 2, 22, 0, 0), 'SAL': 1250.0, 'COMM': 500.0, 'DEPTNO': 30}, {'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 4, 2, 0, 0), 'SAL': 2975.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 9, 28, 0, 0), 'SAL': 1250.0, 'COMM': 1400.0, 'DEPTNO': 30}, {'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 5, 1, 0, 0), 'SAL': 2850.0, 'COMM': None, 'DEPTNO': 30}, {'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 6, 9, 0, 0), 'SAL': 2450.0, 'COMM': None, 'DEPTNO': 10}, {'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': datetime.datetime(1982, 12, 9, 0, 0), 'SAL': 3000.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'MGR': None, 'HIREDATE': datetime.datetime(1981, 11, 17, 0, 0), 'SAL': 5000.0, 'COMM': None, 'DEPTNO': 10}, {'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 9, 8, 0, 0), 'SAL': 1500.0, 'COMM': 0.0, 'DEPTNO': 30}, {'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': datetime.datetime(1983, 1, 12, 0, 0), 'SAL': 1100.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 12, 3, 0, 0), 'SAL': 950.0, 'COMM': None, 'DEPTNO': 30}, {'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': datetime.datetime(1981, 12, 3, 0, 0), 'SAL': 3000.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': datetime.datetime(1982, 1, 23, 0, 0), 'SAL': 1300.0, 'COMM': None, 'DEPTNO': 10}]

In [6]:
import pandas as pd
pd.DataFrame(emp_list)

    EMPNO   ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1982-12-09  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10